In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Transactions.csv')
swift_codes = pd.read_csv('Swift Codes.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  100 non-null    int64
 1   Account Number  100 non-null    int64
 2   Sort Code       100 non-null    object
 3   Bank            100 non-null    object
dtypes: int64(2), object(2)
memory usage: 3.2+ KB

In [4]:
df.head()

   Transaction ID  Account Number Sort Code              Bank
0            3888        62230725  95-98-82  Data Source Bank
1            4746        83172326  42-86-38     Barclays Bank
2            5404        34302539  53-28-21     Barclays Bank
3            9013        13350031  93-87-71           Natwest
4            2535        68745993  57-14-32     Barclays Bank

In [5]:
# In the Transactions table, there is a Sort Code field which contains dashes. 
# We need to remove these so just have a 6 digit string
df['Sort Code'] = df['Sort Code'].apply(lambda x: x.replace('-',''))

In [6]:
df['Sort Code']

0     959882
1     428638
2     532821
3     938771
4     571432
       ...
95    241512
96    591751
97    297239
98    218530
99    493126
Name: Sort Code, Length: 100, dtype: object

In [7]:
swift_codes.head()

            Bank SWIFT code Check Digits
0    Lloyds Bank       LOYD           C1
1  Barclays Bank       BARC           22
2        Halifax       HLFX           22
3           HSBC       HBUK           4B
4        Natwest       NWBK           2L

In [8]:
# Use the SWIFT Bank Code lookup table to bring in additional information about the SWIFT code and 
# Check Digits of the receiving bank account
df = df.join(swift_codes,lsuffix='Bank', rsuffix='Bank')
df = df.drop('BankBank',axis=1)

In [9]:
# Add a field for the Country Code
df['Country Code'] = 'GB'

In [10]:
df['IBAN'] = df['Country Code'] + df['Check Digits'].astype(np.str) + df['SWIFT code'] + df['Sort Code'] + df['Account Number'].astype(np.str)

c:\users\taraka pavan sriram\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: `np.str` is a deprecated alias for the builtin `str`. To silence this warning, use `str` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.str_` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  """Entry point for launching an IPython kernel.

In [11]:
df['IBAN'].head()

0    GBC1LOYD95988262230725
1    GB22BARC42863883172326
2    GB22HLFX53282134302539
3    GB4BHBUK93877113350031
4    GB2LNWBK57143268745993
Name: IBAN, dtype: object

In [12]:
# Create the IBAN as above
output = df[['Transaction ID','IBAN']].head()

In [13]:
output.head()

   Transaction ID                    IBAN
0            3888  GBC1LOYD95988262230725
1            4746  GB22BARC42863883172326
2            5404  GB22HLFX53282134302539
3            9013  GB4BHBUK93877113350031
4            2535  GB2LNWBK57143268745993